Topics Covered :
- loc
- iloc 

- Handling missing values

- ffill() -> forward fill
- bfill() -> backward fill
- fillna()
- isnull()
- notnull()

In [23]:
import pandas as pd

name = ["kunal" , "ram" , "shyam" , "roy" , "rutik" , "rupesh"]
sub = ["sql" , "excel" , "powerbi" , "python" , "java" , "cpp"]
score = [50,60,30,40,50,10]
clg = ['sggs' , 'mit' , 'harvard' , 'oxford' , 'mit-wpu' , 'mkit']

details = {"NAME" : name , "SUB" : sub , "SCORE" : score , "clg" : clg}
data = pd.DataFrame(details)
data

     NAME      SUB  SCORE      clg
0   kunal      sql     50     sggs
1     ram    excel     60      mit
2   shyam  powerbi     30  harvard
3     roy   python     40   oxford
4   rutik     java     50  mit-wpu
5  rupesh      cpp     10     mkit

In [ ]:
# understading loc(stop index included)
# **************************************************
# data_fram.loc[row_number]
# data_fram.loc[row_number,["column_name"]]
# data_fram.loc[start:stop]
# data_fram.loc[start : stop , "column_name"]
# data_fram.loc[start:stop , ["col1" , "col2"]]
# data_fram.loc[start:stop,"col1" :"coln"]
# **************************************************

In [25]:
# normal slicing
print(data[0:3:1])

    NAME      SUB  SCORE      clg
0  kunal      sql     50     sggs
1    ram    excel     60      mit
2  shyam  powerbi     30  harvard

In [29]:
# loc property
print(data.loc[0:2:1])

    NAME      SUB  SCORE      clg
0  kunal      sql     50     sggs
1    ram    excel     60      mit
2  shyam  powerbi     30  harvard

In [33]:
# row number
# data_frame.loc[row_number]
print(data.loc[3])

NAME        roy
SUB      python
SCORE        40
clg      oxford
Name: 3, dtype: object

In [37]:
# row number and column 
# data_frame.loc[row_number , ["column".....]]
print(data.loc[2,["SUB"]])

SUB    powerbi
Name: 2, dtype: object

In [39]:
# start : stop
print(data.loc[0:2])

    NAME      SUB  SCORE      clg
0  kunal      sql     50     sggs
1    ram    excel     60      mit
2  shyam  powerbi     30  harvard

In [45]:
# data_frame.loc[start : stop , ["column_name"]]
print(data.loc[0:2,["SCORE"]])

   SCORE
0     50
1     60
2     30

In [53]:
# data_frame.loc[start:stop,["col1" , "col2"]]
print(data.loc[0:3, ["clg" , "NAME"]])

       clg   NAME
0     sggs  kunal
1      mit    ram
2  harvard  shyam
3   oxford    roy

In [67]:
# data_frame.loc[start:stop,"col1":"col2"]
print(data.loc[0:5:1,"NAME":"SCORE"])

     NAME      SUB  SCORE
0   kunal      sql     50
1     ram    excel     60
2   shyam  powerbi     30
3     roy   python     40
4   rutik     java     50
5  rupesh      cpp     10

In [95]:
# 1. Select a specific row
# data_frame.iloc[row_index]
# Returns the row at position 'row_index' as a Series

# 2. Select a specific element (row and column by index)
# data_frame.iloc[row_index, column_index]
# Returns the value at the specified row and column index

# 3. Select a range of rows (stop index is exclusive)
# data_frame.iloc[start:stop]
# Returns rows from 'start' to 'stop-1'

# 4. Select a range of rows and a single column
# data_frame.iloc[start:stop, column_index]
# Returns a DataFrame of selected rows and one column

# 5. Select a range of rows and multiple columns
# data_frame.iloc[start:stop, [col1_index, col2_index]]
# Use a list to specify multiple column positions

# 6. Select a range of rows and a range of columns
# data_frame.iloc[start:stop, col1_index:colN_index]
# Returns a slice of rows and columns (column stop is exclusive)

# 7. Select specific row positions
# data_frame.iloc[[row1_index, row2_index, rowN_index]]
# Returns only the listed rows

# 8. Select specific rows and columns
# data_frame.iloc[[row1, row2], [col1, col2]]
# Full flexibility for selecting subsets

In [71]:
# iloc property
print(data.iloc[0:2:1])

    NAME    SUB  SCORE   clg
0  kunal    sql     50  sggs
1    ram  excel     60   mit

In [79]:
# data_fram.iloc[row_number,column_number]
print(data.iloc[1,3])

mit

In [81]:
print(data.iloc[0:2]) # end index will be excluded

    NAME    SUB  SCORE   clg
0  kunal    sql     50  sggs
1    ram  excel     60   mit

In [83]:
print(data.iloc[0:3,0:2]) # end index is excluded

    NAME      SUB
0  kunal      sql
1    ram    excel
2  shyam  powerbi

In [89]:
print(data.iloc[0:5,0])

0    kunal
1      ram
2    shyam
3      roy
4    rutik
Name: NAME, dtype: object

In [99]:
print(data.iloc[[1,2,3]])

    NAME      SUB  SCORE      clg
1    ram    excel     60      mit
2  shyam  powerbi     30  harvard
3    roy   python     40   oxford

In [103]:
# removing null values 
# Create a DataFrame with three columns
data = {
    'Name': ['Alice', 'Bob', 'Charlie', None, 'Eva', 'Frank', 'Grace', 'Henry', None, 'Ivy'],
    'Age': [25, None, 35, 40, None, 32, 28, None, 45, 37],
    'Score': [85.5, 92.0, None, 76.5, 88.0, None, 79.5, 91.0, 67.5, None]
}

# Create the DataFrame
df = pd.DataFrame(data)

      Name   Age  Score
0    Alice  25.0   85.5
1      Bob   NaN   92.0
2  Charlie  35.0    NaN
3     None  40.0   76.5
4      Eva   NaN   88.0
5    Frank  32.0    NaN
6    Grace  28.0   79.5
7    Henry   NaN   91.0
8     None  45.0   67.5
9      Ivy  37.0    NaN

In [109]:
print(df.dropna()) # complete will be removed row if it has none value

    Name   Age  Score
0  Alice  25.0   85.5
6  Grace  28.0   79.5

In [124]:
new_df = df.fillna(0)

In [126]:
new_df

      Name   Age  Score
0    Alice  25.0   85.5
1      Bob   0.0   92.0
2  Charlie  35.0    0.0
3        0  40.0   76.5
4      Eva   0.0   88.0
5    Frank  32.0    0.0
6    Grace  28.0   79.5
7    Henry   0.0   91.0
8        0  45.0   67.5
9      Ivy  37.0    0.0

In [134]:
print(df.ffill())

      Name   Age  Score
0    Alice  25.0   85.5
1      Bob  25.0   92.0
2  Charlie  35.0   92.0
3  Charlie  40.0   76.5
4      Eva  40.0   88.0
5    Frank  32.0   88.0
6    Grace  28.0   79.5
7    Henry  28.0   91.0
8    Henry  45.0   67.5
9      Ivy  37.0   67.5

In [136]:
print(df.bfill())

      Name   Age  Score
0    Alice  25.0   85.5
1      Bob  35.0   92.0
2  Charlie  35.0   76.5
3      Eva  40.0   76.5
4      Eva  32.0   88.0
5    Frank  32.0   79.5
6    Grace  28.0   79.5
7    Henry  45.0   91.0
8      Ivy  45.0   67.5
9      Ivy  37.0    NaN